#include<stdio.h>
#include<stdlib.h>
#include<time.h>
#include<string>
int main()
{
	int n;
	const string *list[] = {
					"1-匡图上青","2-罗龙光","3-马维剑","4-王若冰","5-杨锦涛","6-郑文韬",
					"7-邹文浩","8-冯月阳","9-李俊俏","10-牟旭","11-谢欣奕","12-陈均奕",
					"13-赖伟超","14-申冉冉","15-时霁冰","16-杨泽南","17-胡金琦","18-潘玥彤",
					"19-徐杰","20-张玉奇","21-张越棋","22-安璠娟","23-杜斯博","24-凌自强",
					"25-舒胜军","26-魏治亮","27-马正东","28-朱博文","29-张文婷"
					}; 
	int arr[] = {1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29};
	
	srand(time(NULL));
	while(scanf("%d",&n))
	{
		printf("------------------------------------------------------------\n");
		while(n)
		{
			int r=arr[(rand()%29)+1];
			if(r)
			{
				printf("%s ",list[r]);
			}
			else
			{
				++n;
			}
			n--;
		}
		printf("\n------------------------------------------------------------\n\n");
	}
	return 0;
}
